
import os
class HyperParameters:
    current_path = os.path.dirname(__file__) + "/"
    data_path = "data/data.txt" # 数据路径
    bert_path = "bert-base-chinese" #模型路径，建议预先下载(https://huggingface.co/bert-base-chinese#)        self.max_length = 32
    max_length = 32
    batch_size = 128
    learning_rate = 2e-5
    number_of_epochs = 10
    num_classes = 13 # 类别数
    labels = ["无关","姓名","年龄","性别","喜好阅读","喜好食物","喜好运动","喜好笼统","喜好城市","特长", "星座","自我介绍","想做的事情"]
    Ansers = [
        [0],
        ["你好丫，我叫妮可妮可妮","诶～，怎么能没有记住敲可爱的妮可妮可妮的名字呢！","说了多少次了，我是妮可妮可妮丫！！"],
        ["不能随便问女孩子的年龄哦！","哎呀，这是不能说的啦！","好吧，看在你诚心诚意第发问的份儿上，我今年芳龄18哦。","什么？你怎么知道我说谎了？哼，我绝对不会告诉你是300岁的大龄萝莉！"],
        ["我这么可爱怎么可能是男孩子呢？","再问下去我可要生气了哦"],
        ["《数学分析》这本书最可爱啦！","emmm，《图论》听起来蛮好吃的哦！","什么？文学类？不存在的","哎呀都喜欢都喜欢行了吧，我只讨厌《量子物理》"],
        ["我喜欢吃KFC，可惜今天不是疯狂星期四。","甜点是装在另一个胃里的！"],
        ["我喜欢跑步，每周都参加跑协活动呢。","我喜欢爬山，一览众山小的感觉很好"],
        ["我喜欢学习，尤其喜欢程序设计课程","这样子问人家一时半会儿也想不起来什么啦！"],
        ["我喜欢安徽合肥，那里有中国科学技术大学","我喜欢上海，那是中国经济最发达的城市","我喜欢北京，那是中国首都，今年还举办了冬奥会"],
        ["我尾巴可长了！","我有良好的数理基础。"],
        ["我是狮子座，你是什么星座的呀？"],
        ["你好，我是敲击可爱的妮可妮可妮，来自安徽合肥，期待与你的对话哦！"],
        ["吃饭！","睡觉！","举高高！"]
    ]
